In [588]:
import pandas as pd

In [589]:
df = pd.read_csv("train.csv")

In [592]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [543]:
df1 = df.loc[:,['Pclass','Sex','Embarked','Fare','Age','SibSp','Ticket']]
df1.head()

   Pclass     Sex Embarked     Fare   Age  SibSp            Ticket
0       3    male        S   7.2500  22.0      1         A/5 21171
1       1  female        C  71.2833  38.0      1          PC 17599
2       3  female        S   7.9250  26.0      0  STON/O2. 3101282
3       1  female        S  53.1000  35.0      1            113803
4       3    male        S   8.0500  35.0      0            373450

In [544]:
df1.isnull().sum()

Pclass        0
Sex           0
Embarked      2
Fare          0
Age         177
SibSp         0
Ticket        0
dtype: int64

In [545]:
df1.Age.agg(['mean','median','max','min','count'])

mean       29.699118
median     28.000000
max        80.000000
min         0.420000
count     714.000000
Name: Age, dtype: float64

In [546]:
df1.fillna({'Age':df.Age.median(),'Embarked':df.Embarked.value_counts().index[0]},inplace=True)

In [586]:
 len(df1.Ticket.unique())

681

In [547]:
df1.isnull().sum()

Pclass      0
Sex         0
Embarked    0
Fare        0
Age         0
SibSp       0
Ticket      0
dtype: int64

In [548]:

df_new = pd.get_dummies(df1, columns = ['Sex','Embarked','Ticket'])
df_new.head()

,Pclass,Fare,Age,SibSp,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S,Ticket_110152,...,Ticket_STON/O2. 3101290,Ticket_SW/PP 751,Ticket_W./C. 14258,Ticket_W./C. 14263,Ticket_W./C. 6607,Ticket_W./C. 6608,Ticket_W./C. 6609,Ticket_W.E.P. 5734,Ticket_W/C 14208,Ticket_WE/P 5735
0,3,7.2500,22.0,1,0,1,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
1,1,71.2833,38.0,1,1,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,3,7.9250,26.0,0,1,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
3,1,53.1000,35.0,1,1,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
4,3,8.0500,35.0,0,0,1,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0

In [549]:
df_new.isnull().sum()

Pclass                      0
Fare                        0
Age                         0
SibSp                       0
Sex_female                  0
Sex_male                    0
Embarked_C                  0
Embarked_Q                  0
Embarked_S                  0
Ticket_110152               0
Ticket_110413               0
Ticket_110465               0
Ticket_110564               0
Ticket_110813               0
Ticket_111240               0
Ticket_111320               0
Ticket_111361               0
Ticket_111369               0
Ticket_111426               0
Ticket_111427               0
Ticket_111428               0
Ticket_112050               0
Ticket_112052               0
Ticket_112053               0
Ticket_112058               0
Ticket_112059               0
Ticket_112277               0
Ticket_112379               0
Ticket_113028               0
Ticket_113043               0
                           ..
Ticket_SOTON/OQ 392082      0
Ticket_SOTON/OQ 392086      0
Ticket_SOTON/OQ 392089      0
Ticket_SOTON/OQ 392090      0
Ticket_STON/O 2. 3101269    0
Ticket_STON/O 2. 3101273    0
Ticket_STON/O 2. 3101274    0
Ticket_STON/O 2. 3101275    0
Ticket_STON/O 2. 3101280    0
Ticket_STON/O 2. 3101285    0
Ticket_STON/O 2. 3101286    0
Ticket_STON/O 2. 3101288    0
Ticket_STON/O 2. 3101289    0
Ticket_STON/O 2. 3101292    0
Ticket_STON/O 2. 3101293    0
Ticket_STON/O 2. 3101294    0
Ticket_STON/O2. 3101271     0
Ticket_STON/O2. 3101279     0
Ticket_STON/O2. 3101282     0
Ticket_STON/O2. 3101283     0
Ticket_STON/O2. 3101290     0
Ticket_SW/PP 751            0
Ticket_W./C. 14258          0
Ticket_W./C. 14263          0
Ticket_W./C. 6607           0
Ticket_W./C. 6608           0
Ticket_W./C. 6609           0
Ticket_W.E.P. 5734          0
Ticket_W/C 14208            0
Ticket_WE/P 5735            0
Length: 690, dtype: int64

In [550]:
train = df_new
y = df.loc[:,'Survived']

In [551]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [552]:
train = train.values
train

array([[ 3.    ,  7.25  , 22.    , ...,  0.    ,  0.    ,  0.    ],
       [ 1.    , 71.2833, 38.    , ...,  0.    ,  0.    ,  0.    ],
       [ 3.    ,  7.925 , 26.    , ...,  0.    ,  0.    ,  0.    ],
       ...,
       [ 3.    , 23.45  , 28.    , ...,  0.    ,  0.    ,  0.    ],
       [ 1.    , 30.    , 26.    , ...,  0.    ,  0.    ,  0.    ],
       [ 3.    ,  7.75  , 32.    , ...,  0.    ,  0.    ,  0.    ]])

In [553]:
y = y.values

In [554]:
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier

In [555]:
x_train,x_test,y_train,y_test = train_test_split(train,y,test_size=.20,random_state=10)

In [556]:
clf0 = LogisticRegression()
clf1 = RandomForestClassifier()
clf2 = DecisionTreeClassifier()

In [557]:
#log.fit(x_train,y_train)
clf2.fit(x_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [558]:
clf2.score(x_train,y_train)

0.9971910112359551

In [559]:
clf2.score(x_test,y_test)

0.8770949720670391

In [560]:
test = pd.read_csv('test.csv')

In [561]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [564]:
def write_test(test_data, clf):
    
    features_raw = test_data.loc[:,['Pclass','Sex','Embarked','Fare','Age','SibSp','Ticket']]   
    #features_raw = test_data.drop(['Name','PassengerId','Cabin','Parch'], axis=1)
    
    features = pd.get_dummies(features_raw, columns = ['Sex','Embarked','Ticket'])
   
    print(features.head())
    
    features['Age'].fillna(features['Age'].mean(), inplace=True)
    
  
    features = features.fillna(0)
    
   # features['Age'] = pd.cut(features['Age'],5, labels=list(range(5)))
   # features = pd.get_dummies(features, columns = ['Age'])

    pred = clf.predict(features)
    print(pred)
    
    test_data.insert(1, 'Survived', pred)

    test_data = test_data.drop(['Pclass','Name','Fare', 'Sex', 'Age', 'SibSp', 'Parch',
                               'Ticket', 'Cabin', 'Embarked'], axis=1)
    
    print(test_data.head())
    test_data.to_csv('my_out.csv', index=False)

In [565]:
write_test(test, clf2)

   Pclass     Fare   Age  SibSp  Sex_female  Sex_male  Embarked_C  Embarked_Q  \
0       3   7.8292  34.5      0           0         1           0           1
1       3   7.0000  47.0      1           1         0           0           0
2       2   9.6875  62.0      0           0         1           0           1
3       3   8.6625  27.0      0           0         1           0           0
4       3  12.2875  22.0      1           1         0           0           0

   Embarked_S  Ticket_110469         ...          Ticket_SOTON/OQ 392083  \
0           0              0         ...                               0
1           1              0         ...                               0
2           0              0         ...                               0
3           1              0         ...                               0
4           1              0         ...                               0

   Ticket_STON/O 2. 3101268  Ticket_STON/O 2. 3101291  \
0                         0                         0
1                         0                         0
2                         0                         0
3                         0                         0
4                         0                         0

   Ticket_STON/O2. 3101270  Ticket_STON/OQ. 369943  Ticket_W./C. 14260  \
0                        0                       0                   0
1                        0                       0                   0
2                        0                       0                   0
3                        0                       0                   0
4                        0                       0                   0

   Ticket_W./C. 14266  Ticket_W./C. 6607  Ticket_W./C. 6608  \
0                   0                  0                  0
1                   0                  0                  0
2                   0                  0                  0
3                   0                  0                  0
4                   0                  0                  0

   Ticket_W.E.P. 5734
0                   0
1                   0
2                   0
3                   0
4                   0

[5 rows x 372 columns]

ValueError: Number of features of the model must match the input. Model n_features is 690 and input n_features is 372

In [587]:
 len(test.Ticket.unique())

363